// dictionary.js
// ᚠ ᚢ ᚦ ᚨ ᚩ ᚪ ᚫ ᚬ ᚭ ᚮ ᚯ ᚰ ᚱ ᚲ ᚳ ᚴ ᚵ ᚶ ᚷ ᚸ ᚹ ᚺ ᚻ ᚼ ᚽ ᚾ ᚿ ᛀ ᛁ ᛃ ᛄ ᛅ ᛆ ᛇ ᛈ ᛉ ᛊ ᛋ ᛌ ᛍ ᛎ ᛏ ᛐ ᛑ ᛒ ᛓ ᛔ ᛕ ᛖ ᛗ ᛘ ᛙ ᛚ ᛛ ᛜ ᛝ ᛞ ᛟ
const GlobalDictionary = {
    // المرحلة 1: أساسيات
    "نار":    { symbol: "ᛟ", options: ["نار", "نور", "دفء", "رماد"] },
    "ماء":    { symbol: "ᚢ", options: ["ماء", "نهر", "بحر", "سراب"] },
    "ملك":   { symbol: "ᚦ", options: ["الملك", "الوزير", "الحارس", "الظلام"] },
    "شرب":   { symbol: "ᛝ", options: ["يشرب", "يأكل", "يسكب", "يغرق"] },

    // المرحلة 2: الطبيعة
    "شمس":  { symbol: "ᛛ", options: ["الشمس", "الفجر", "الذهب", "الحرارة"] },
    "قمر":  { symbol: "ᛒ", options: ["القمر", "الليل", "الفضة", "الحلم"] },
    "شروق":   { symbol: "↑", options: ["تشرق", "تغيب", "تنام", "تتحرك"] },
    "سماء": { symbol: "ᛄ", options: ["السماء", "الأرض", "الجبل", "الكون"] },

    // المرحلة 3: المتضادات
    "محارب": { symbol: "ᚴ", options: ["المحارب", "العدو", "البطل", "الخائن"] },
    "حب": { symbol: "ᚩ", options: ["الحب", "الخيانة", "الكره", "النزاع"] },
    "سيف":  { symbol: "ᚮ", options: ["السيف", "الدرع", "الرمح", "القوة"] },
    "موت":  { symbol: "ᚸ", options: ["الموت", "النهاية", "التراب", "النسيان"] },
    "حياة": { symbol: "ᚺ", options: ["الحياة", "البداية", "الأمل", "النمو"] },
    "سلام": { symbol: "ᚯ", options: ["السلام", "الهدوء", "الأمان", "البيت"] },

    // المرحلة 4: المرصد
    "عين":  { symbol: "ᛈ", options: ["العين", "القلب", "العقل", "الروح"] },
    "رؤية":    { symbol: "ᛉ", options: ["ترى", "تسمع", "تبكي", "تخفي"] },
    "نجم":  { symbol: "ᚠ", options: ["النجم", "الشهاب", "البعيد", "الشرارة"] },
    "سحاب": { symbol: "ᚪ", options: ["السحاب", "الدخان", "الريح", "الظل"] },

    // المرحلة 5: الطقوس
    "كاهن":  { symbol: "ᛜ", options: ["الكاهن", "الحكيم", "العجوز", "الساحر"] },
    "وضع":    { symbol: "ᚳ", options: ["يضع", "يأخذ", "يحرق", "يرمي"] },
    "قربان": { symbol: "ᚻ", options: ["القربان", "الكنز", "القلادة", "الخبز"] },
    "يأكل":   { symbol: "ᛔ", options: ["تأكل", "تحرق", "تلمس", "تغضب"] },

    // المرحلة 6: دار العلوم
    "دار": { symbol: "ᛞ", options: ["دار","البيت","القصر","المعبد"] },
    "علم": { symbol: "ᚫ", options: ["علم","الجهل","الحكمة","الكتابة"] },
    "هنا": { symbol: "ᚵ", options: ["هنا","","",""] },
    "نحفظ": { symbol: "ᛘ", options: ["نحفظ","ننسى","نكتب","نضيع"] },
    "صوت": { symbol: "ᚹ", options: ["صوت","صدى","همس","صراخ"] },
    "الأجداد": { symbol: "ᚰ", options: ["الأجداد","","",""] },
    "ليبقى": { symbol: "ᛑ", options: ["ليبقى","","",""] },
    "أثر": { symbol: "ᛏ", options: ["أثر","الغبار","الذكرى","الطريق"] },
    "الحضارة": { symbol: "ᚾ", options: ["الحضارة","","",""] },
    "خالداً": { symbol: "ᛚ", options: ["خالداً","","",""] },

};
