// levels.js
const GameLevels = [
    {
        type: "SlidingCrossGame",
        title: "دار التراث",
        text: "أهلاً بك في دار العلم. هنا نحفظ صوت الأجداد، ليبقى أثر الحضارة خالداً",
        emoji: '<i class="fa-solid fa-cloud-sun"></i>'
    },
    {
        type: "SlidingCrossGame",
        title: "أثليجارد",
        text: "فِي أثليجاردَ صَحَا بَهِيُّ الضِّيَاءْ, وَانْسَابَ عِطْرُ الزَّهْرِ فَوْقَ المَاءْ, مَمْلَكَةٌ صِيغَتْ بِسِحْرِ السَّنَاءْ",
        emoji: '<i class="fa-brands fa-pagelines"></i>'
    },
    {
        type: "SlidingCrossGame",
        title: "بيان نقابة التجار",
        text: "إلى ديوان الرقابة، نرفع إليكم استغاثتنا. لقد أصبحت رحلاتنا كمن يطارد سراباً؛ السفن المغادرة لـ 'أثليجارد' لا تجد طريق العودة، والخرائط التي رسمها أجدادنا لم تعد تنطبق على السواحل. البحارة يقسمون أنهم يمرون بمكان الميناء فلا يجدون إلا ضباباً كثيفاً يبتلع الصوت والضوء. هل نسي البحرُ مدينتنا، أم أن مدينتنا هي التي نسيت مكانها؟",
        emoji: '<i class="fa-regular fa-cloud"></i>'
    },
    {
        type: "SlidingGame",
        title: "صمود الأفق",
        text: "مرحباً زوجتي العزيزة، سأزوركِ قريباً. نحن نبني هذا التمثال العظيم منذ ثلاث سنوات، اليوم قررت أن أتحلى بالشجاعة وسألت رئيس العمال عما يمثله هذا الرجل الحجري العظيم الذي ينظر إلى الأفق بصمود، لكن رئيس العمال نظر إليّ بصمت يشوبه الريبة.. ثم قال: 'نحن نبني لأننا أُمرنا بذلك، لا تسأل عن السبب كي لا تنسى كيف تمسك المطرقة'. ما الذي نبنيه بالضبط يا حبيبتي؟",
        emoji: '<i class="fa-solid fa-envelope"></i>'
    },
    {
        type: "SlidingGame",
        title: "إشاعات",
        text: "يقولون إن الكلمات لم تعد حبراً على ورق. بالأمس رأيتُ أحد اللغويين الملكيين يهمس بلفافة أمام شجيرة ذابلة، فازهرت في ثوانٍ، لكن اللغوي سقط مغشياً عليه ولما استيقظ لم يكن يعرف اسمه. هذه القوة ليست هبة، إنها مقايضة شيطانية. إنهم يسمونه 'الرنين'، وأخشى أن صدى هذا الرنين سيقتلع جذورنا جميعاً.",
        emoji: '<i class="fa-solid fa-head-side-cough"></i>'
    },
    
    {
        type: "SlidingGame",
        title: "الرخاء",
        text: "بفضل حكمة جلالته العظمى، لم نعد بحاجة للقلق بشأن المحاصيل أو الأسوار. بكلمة واحدة منه، تمتلئ المخازن، وبكلمة منه تصبح حدودنا منيعة. إن تضحياته الشخصية هي ما جعلت أثليجارد جنة لا تغيب عنها الشمس.",
        emoji: '<i class="fa-solid fa-cloud"></i>'
    },
    {
        type: "SlidingGame",
        title: "المرساة",
        text: "أنا (....)، ابن الملك (....). إذا نسيتُ اسمي، فقد نسي العالم آخر شاهد. الرنين يحاول محوي لأنني أعرفه. سأستخدم الرنين لأحفر اسمي في عقلي كالنار.",
        emoji: '<i class="fa-solid fa-pen-nib"></i>'
    },
    {
        type: "slidingBroken",
        title: "وفاة",
        text: "أتذكر ذلك اليوم جيداً. كانت السماء تمطر رذاذاً ذهبياً حين فارقت أمي الحياة في الجناح الشرقي. كانت تمسك بيدي وتهمس: 'لا تدعهم يسرقون حكايتنا'. رائحة بخور الياسمين كانت تملأ الغرفة، ووالدي كان يبكي بصمت عند شرفة القصر.",
        emoji: '<i class="fa-solid fa-dove"></i>'
    },
    {
        type: "slidingBroken",
        title: "السقوط الصامت",
        text: "لقد قتله بُظلم! لم اعتقد أن الملك سيفعل ذلك، لقد شهدت الأمر بعيني، كيف يمكن للملك أن يقتله بحجة \"إفشاء أسرار المملكة\" وابي نفسه من أخبره بها!",
        emoji: '<i class="fa-solid fa-gavel"></i>'
    },
    {
        type: "slidingBroken",
        title: "الصدى",
        text: "أتذكر ذلك اليوم.. أظنها كانت تمطر حبراً أسود حين فارقت الحياة في الجناح. كانت تمسك بيدي وتهمس \"أحبك\". رائحة الغبار كانت تملأ المكان، والملك كان عند شرفة القصر.",
        emoji: '<i class="fa-solid fa-dove"></i>'
    },
    {
        type: "slidingBroken",
        title: "مرآة العقل",
        text: "هل أنا من يمسك الريشة الآن؟ أم أن الحبر هو من يحرك يدي ليملأ هذا الفراغ؟ بالأمس رأيتُ وجهاً في المرآة لم أعرفه، كان يهمس لي بلغة لم أسمعها قط، لكن قلبي ارتجف لها.. هل هذا هو الرنين؟ أم أنه سحر أسود ألقاه عليّ أحد السحرة الحاقدين ليحبسني في هذا القصر المهجور؟ بدأتُ أشك في أن أثليجارد موجودة أصلاً. ربما أنا مجرد سجين في زنزانة باردة، وهذه الجدران الذهبية والقصور والديون ما هي إلا خيالات نسجتها وحدتي لتسلية عقلي المحتضر. أبي.. هل هو ملك فعلاً؟ أم أنه مجرد صدى لصوت قديم في رأسي؟",
        emoji: '<i class="fa-solid fa-wind"></i>'
    },
    {
        type: "slidingBroken",
        title: "الخلاص المر",
        text: "الرنين اللغوي هو سرطان الوجود. نحن لم نكتشف لغة، بل نبشنا في جرح كوني. أنا مسؤول عن تدمير هذه اللغة قبل أن تلتهم ما تبقى من وعي البشر. سأستخدم آخر ذرات ذاكرتي لأحفر نصاً يقتل نفسه. إذا كنت تقرأ هذا، فاعلم أنني لم أكن بطلاً، بل كنتُ الممحاة الأخيرة في يد قدرٍ غاضب",
        emoji: '<i class="fa-solid fa-feather"></i>'
    },
];